AcGiPhotographicExposureParameters.convertBrightnessToExposure(System.Double)
Converts Brightness value to EV
brt: Brightness Value
Returns: Exposure value

AcGiPhotographicExposureParameters.convertExposureToBrightness(System.Double)
Converts EV to a calibrated Brightness value
exp: Exposure Value
Returns: Brightness value

AcGiPhotographicExposureParameters.copyFrom(AcRxObject!System.Runtime.CompilerServices.IsConst*)
Copies member data from source object
Returns:
Acad::eOk if copy is successful

AcGiPhotographicExposureParameters.setBrightness(System.Double)
Sets exact brightness and updates exposure calculated from brightness

AcGiPhotographicExposureParameters.whitePoint
Gets White Point for photographic exposure parameters
Returns:
Temperature of White Point in Kelvins

AcGiPhotographicExposureParameters.setWhitePoint(System.Double)
Sets White Point for photographic exposure parameters in Kelvins
Affects the chromaticity of a scene
whitePoint:
Temperature of White Point in Kelvins

AcGiPhotographicExposureParameters.exposure
Gets Exposure for photographic exposure parameters.
Returns:
Exposure for photographic exposure parameters

AcGiPhotographicExposureParameters.setExposure(System.Double)
Sets Exposure Value for photographic exposure parameters.
This value is a combination of a camera's shutter speed (exposure time) and f-number (depth of field)
and determines the amount of motion blur in a scene.
exposure:
Exposure Value for photographic exposure parameters.

AcGiPhotographicExposureParameters
Container class for all photographic exposure parameters.
Remarks:
Properties defined here used by RENDERENGINE=1.
Base class properties used by RENDERENGINE=0.